Информационная_база/src/Reports/ПлатежныйКалендарь/ПлатежныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПлатежныйКалендарь</name>
  <attributes>
    <name>ОтображатьОрганизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьСтатью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьСчетКассу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТипДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПланирования</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДиаграммы</name>
    <type>
      <types>EnumRef.ВариантыДиаграммыПлатежныйКалендарь</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПересчетаСумм</name>
    <type>
      <types>EnumRef.ПлатежныйКалендарьВариантыПересчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьПоДням</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазвернутьДо</name>
    <type>
      <types>EnumRef.АналитикаПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОтчетУНФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

Информационная_база/src/Enums/ТипыДенежныхСредств/ТипыДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДенежныхСредств</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/Reports/ПлатежныйКалендарь/Forms/ФормаВыбораСчетаКассы/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;
	Элементы.Касса.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ЕстьОшибкиВЗаполненииПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТипДенежныхСредств", ТипДенежныхСредств);
	
	Если ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
		Результат.Вставить("БанковскийСчетКасса", Касса);
	ИначеЕсли ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
		Результат.Вставить("БанковскийСчетКасса", БанковскийСчет);
	Иначе
		Результат.Вставить("БанковскийСчетКасса", Неопределено);
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДенежныхСредствПриИзменении(Элемент)
	
	Элементы.БанковскийСчет.Видимость = ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные");
	Элементы.Касса.Видимость 		  = ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные");
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиВЗаполненииПолей()
	
	Результат = Ложь;
	
	Если ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") И НЕ ЗначениеЗаполнено(Касса) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не выбрана касса!'");
		Сообщение.Поле = "Касса";
		Сообщение.Сообщить();
		Результат = Истина;
	КонецЕсли;
	
	Если ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") И НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не выбрана банковский счет!'");
		Сообщение.Поле = "БанковскийСчет";
		Сообщение.Сообщить();
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
